using System;

namespace Diary {

    #region Задание
    /// Разработать ежедневник.
    /// В ежедневнике реализовать возможность 
    /// - создания
    /// - удаления
    /// - реактирования 
    /// записей
    /// 
    /// В отдельной записи должно быть не менее пяти полей
    /// 
    /// Реализовать возможность 
    /// - Загрузки даннах из файла
    /// - Выгрузки даннах в файл
    /// - Добавления данных в текущий ежедневник из выбранного файла
    /// - Импорт записей по выбранному диапазону дат
    /// - Упорядочивания записей ежедневника по выбранному полю
    #endregion

    class Program {

        // Идентификаторы записей (Id_Note) должны быть различны (в рамках одной программы).
        // Для этого при загрузке записей из файла ежедневника с совпадающими идентификаторами
        // они будут меняться (для исключения совпадения идентификаторов).
        
        static void Main(string[] args) {

            Note oneNote = new Note("Первая пробная запись", new Person("Иванов", "Иван"), Mood.BAD);

            Console.WriteLine("Нажмите клавишу...");
            Console.ReadKey();  // задержка для формирования промежутка времени создания
                                // для проверки импорта по диапазону дат в записях

            Note twoNote = new Note("Вторая пробная запись", new Person("Павлов", "Павел", "Павлович", new DateTime(1986, 7, 1)));

            Console.WriteLine("Нажмите клавишу...");
            Console.ReadKey();  // задержка для формирования промежутка времени создания
                                // для проверки импорта по диапазону дат в записях

            Note threeNote = new Note("Третья пробная запись", new Person("Петров", "Петр", "Петрович", new DateTime(2000, 1, 1)));

            Console.WriteLine("Нажмите клавишу...");
            Console.ReadKey();  // задержка для формирования промежутка времени создания
                                // для проверки импорта по диапазону дат в записях

            // СОЗДАНИЕ ЕЖЕДНЕВНИКА
            ////////////////////////////////////////////////////////////////////////////
            Notes notes1 = new Notes(oneNote, twoNote);
            ////////////////////////////////////////////////////////////////////////////
            ///


            notes1.insertNotes(threeNote);   // добавляем запись в ежедневник

            // Пример добавления массива записей (можно раскомментировать для тестирования)
            //Console.WriteLine("Нажмите клавишу...");
            //Console.ReadKey();  // задержка для формирования промежутка времени создания в записях

            //notes1.insertNotes(new Note("Четвертая пробная запись", new Person("Петров", "Петр", "Петрович", new DateTime(2000, 1, 1))),
            //                    new Note("Пятая пробная запись", new Person("Петров", "Петр", "Петрович", new DateTime(2000, 1, 1))),
            //                    new Note("Шестая пробная запись", new Person("Петров", "Петр", "Петрович", new DateTime(2000, 1, 1)))
            //                  );

            // РЕДАКТИРОВАНИЕ ЗАПИСИ В ЕЖЕДНЕВНИКЕ
            ////////////////////////////////////////////////////////////////////////////
            notes1.editNotes(3, "Дополнительно измененная запись", Mood.GREAT);
            ////////////////////////////////////////////////////////////////////////////
            ///

            // УДАЛЕНИЕ ЗАПИСИ twoNote ИЗ ЕЖЕДНЕВНИКА
            ////////////////////////////////////////////////////////////////////////////
            notes1.deleteNotes(twoNote);
            ////////////////////////////////////////////////////////////////////////////
            ///

            // СОРТИРОВКА ЕЖЕДНЕВНИКА ПО ПОЛЮ Id_Note ПО УБЫВАНИЮ
            ////////////////////////////////////////////////////////////////////////////
            notes1.sortNotes(FieldsNote.ID_NOTE, Order.DESC);
            ////////////////////////////////////////////////////////////////////////////
            ///

            Console.WriteLine($"Количество записей в созданном ежедневнике - {notes1.Count}");

            // ВЫГРУЗКА ЕЖЕДНЕВНИКА В ФАЙЛ
            ////////////////////////////////////////////////////////////////////////////
            notes1.unloadNotes(@"C:\1\out.diary");
            ////////////////////////////////////////////////////////////////////////////
            ///

            // ДОБАВЛЕНИЕ ДАННЫХ В ЕЖЕДНЕВНИК ИЗ ФАЙЛА (+ ЗАГРУЗКА ДАННЫХ ИЗ ФАЙЛА)
            ////////////////////////////////////////////////////////////////////////////
            notes1.loadNotes(@"C:\1\out.diary");    // количество записей удвоится, т.к. файл
                                                    // загружается тот в который ранее выгружали
            ////////////////////////////////////////////////////////////////////////////
            ///

            // ЗАГРУЗКА ДАННЫХ ПО ВЫБРАННОМУ ДИАПАЗОНУ ДАТ
            ////////////////////////////////////////////////////////////////////////////
            notes1.loadNotes(@"C:\1\out.diary", DateTime.Now.AddSeconds(-4), DateTime.Now);
            ////////////////////////////////////////////////////////////////////////////
            ///

            notes1.unloadNotes(@"C:\1\out_SECOND.diary");


            Console.WriteLine($"Количество записей в ежедневнике после добавления из файла - {notes1.Count}");


            Console.WriteLine();

        }
    }
}